Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxPsi5_reg.h
/** \brief 7D8, Receive Data Memory Low 127 */
#define PSI5_RDM1_27_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057D8u)
/** Alias (User Manual Name) for PSI5_RDM1_27_L.
* To use register names with standard convension, please use PSI5_RDM1_27_L.
*/
#define PSI5_RDML127 (PSI5_RDM1_27_L)

/** \brief 7DC, Receive Data Memory High 127 */
#define PSI5_RDM1_27_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057DCu)
/** Alias (User Manual Name) for PSI5_RDM1_27_H.
* To use register names with standard convension, please use PSI5_RDM1_27_H.
*/
#define PSI5_RDMH127 (PSI5_RDM1_27_H)

/** \brief 7E0, Receive Data Memory Low 128 */
#define PSI5_RDM1_28_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057E0u)
/** Alias (User Manual Name) for PSI5_RDM1_28_L.
* To use register names with standard convension, please use PSI5_RDM1_28_L.
*/
#define PSI5_RDML128 (PSI5_RDM1_28_L)

/** \brief 7E4, Receive Data Memory High 128 */
#define PSI5_RDM1_28_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057E4u)
/** Alias (User Manual Name) for PSI5_RDM1_28_H.
* To use register names with standard convension, please use PSI5_RDM1_28_H.
*/
#define PSI5_RDMH128 (PSI5_RDM1_28_H)

/** \brief 7E8, Receive Data Memory Low 129 */
#define PSI5_RDM1_29_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057E8u)
/** Alias (User Manual Name) for PSI5_RDM1_29_L.
* To use register names with standard convension, please use PSI5_RDM1_29_L.
*/
#define PSI5_RDML129 (PSI5_RDM1_29_L)

/** \brief 7EC, Receive Data Memory High 129 */
#define PSI5_RDM1_29_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057ECu)
/** Alias (User Manual Name) for PSI5_RDM1_29_H.
* To use register names with standard convension, please use PSI5_RDM1_29_H.
*/
#define PSI5_RDMH129 (PSI5_RDM1_29_H)

/** \brief 7F0, Receive Data Memory Low 130 */
#define PSI5_RDM1_30_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057F0u)
/** Alias (User Manual Name) for PSI5_RDM1_30_L.
* To use register names with standard convension, please use PSI5_RDM1_30_L.
*/
#define PSI5_RDML130 (PSI5_RDM1_30_L)

/** \brief 7F4, Receive Data Memory High 130 */
#define PSI5_RDM1_30_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057F4u)
/** Alias (User Manual Name) for PSI5_RDM1_30_H.
* To use register names with standard convension, please use PSI5_RDM1_30_H.
*/
#define PSI5_RDMH130 (PSI5_RDM1_30_H)

/** \brief 7F8, Receive Data Memory Low 131 */
#define PSI5_RDM1_31_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00057F8u)
/** Alias (User Manual Name) for PSI5_RDM1_31_L.
* To use register names with standard convension, please use PSI5_RDM1_31_L.
*/
#define PSI5_RDML131 (PSI5_RDM1_31_L)

/** \brief 7FC, Receive Data Memory High 131 */
#define PSI5_RDM1_31_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00057FCu)
/** Alias (User Manual Name) for PSI5_RDM1_31_H.
* To use register names with standard convension, please use PSI5_RDM1_31_H.
*/
#define PSI5_RDMH131 (PSI5_RDM1_31_H)

/** \brief 800, Receive Data Memory Low 20 */
#define PSI5_RDM2_0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005800u)
/** Alias (User Manual Name) for PSI5_RDM2_0_L.
* To use register names with standard convension, please use PSI5_RDM2_0_L.
*/
#define PSI5_RDML20 (PSI5_RDM2_0_L)

/** \brief 804, Receive Data Memory High 20 */
#define PSI5_RDM2_0_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005804u)
/** Alias (User Manual Name) for PSI5_RDM2_0_H.
* To use register names with standard convension, please use PSI5_RDM2_0_H.
*/
#define PSI5_RDMH20 (PSI5_RDM2_0_H)

/** \brief 808, Receive Data Memory Low 21 */
#define PSI5_RDM2_1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005808u)
/** Alias (User Manual Name) for PSI5_RDM2_1_L.
* To use register names with standard convension, please use PSI5_RDM2_1_L.
*/
#define PSI5_RDML21 (PSI5_RDM2_1_L)

/** \brief 80C, Receive Data Memory High 21 */
#define PSI5_RDM2_1_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000580Cu)
/** Alias (User Manual Name) for PSI5_RDM2_1_H.
* To use register names with standard convension, please use PSI5_RDM2_1_H.
*/
#define PSI5_RDMH21 (PSI5_RDM2_1_H)

/** \brief 810, Receive Data Memory Low 22 */
#define PSI5_RDM2_2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005810u)
/** Alias (User Manual Name) for PSI5_RDM2_2_L.
* To use register names with standard convension, please use PSI5_RDM2_2_L.
*/
#define PSI5_RDML22 (PSI5_RDM2_2_L)

/** \brief 814, Receive Data Memory High 22 */
#define PSI5_RDM2_2_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005814u)
/** Alias (User Manual Name) for PSI5_RDM2_2_H.
* To use register names with standard convension, please use PSI5_RDM2_2_H.
*/
#define PSI5_RDMH22 (PSI5_RDM2_2_H)

/** \brief 818, Receive Data Memory Low 23 */
#define PSI5_RDM2_3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005818u)
/** Alias (User Manual Name) for PSI5_RDM2_3_L.
* To use register names with standard convension, please use PSI5_RDM2_3_L.
*/
#define PSI5_RDML23 (PSI5_RDM2_3_L)

/** \brief 81C, Receive Data Memory High 23 */
#define PSI5_RDM2_3_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000581Cu)
/** Alias (User Manual Name) for PSI5_RDM2_3_H.
* To use register names with standard convension, please use PSI5_RDM2_3_H.
*/
#define PSI5_RDMH23 (PSI5_RDM2_3_H)

/** \brief 820, Receive Data Memory Low 24 */
#define PSI5_RDM2_4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005820u)
/** Alias (User Manual Name) for PSI5_RDM2_4_L.
* To use register names with standard convension, please use PSI5_RDM2_4_L.
*/
#define PSI5_RDML24 (PSI5_RDM2_4_L)

/** \brief 824, Receive Data Memory High 24 */
#define PSI5_RDM2_4_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005824u)
/** Alias (User Manual Name) for PSI5_RDM2_4_H.
* To use register names with standard convension, please use PSI5_RDM2_4_H.
*/
#define PSI5_RDMH24 (PSI5_RDM2_4_H)

/** \brief 828, Receive Data Memory Low 25 */
#define PSI5_RDM2_5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005828u)
/** Alias (User Manual Name) for PSI5_RDM2_5_L.
* To use register names with standard convension, please use PSI5_RDM2_5_L.
*/
#define PSI5_RDML25 (PSI5_RDM2_5_L)

/** \brief 82C, Receive Data Memory High 25 */
#define PSI5_RDM2_5_H /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000582Cu)
/** Alias (User Manual Name) for PSI5_RDM2_5_H.
* To use register names with standard convension, please use PSI5_RDM2_5_H.
*/
#define PSI5_RDMH25 (PSI5_RDM2_5_H)

